_posts/productivity/2014-04-11-german-and-french-in-emacs.html
---
layout: post
title: How to input special German and French characters in emacs
categories: [productivity]
tags: [emacs]
---

<p>
I'm using <code>C-x 8</code> to input special characters from German and French. I will update this page when I find new easy way to input these characters.
</p>

<blockquote>
<p>
C-x 8 RET (translated from C-x 8 &lt;return&gt;) runs the command
insert-char, which is an interactive built-in function in `C source
code'.
</p>
</blockquote>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> German:</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> ä </dt><dd>C-x 8 "a
</dd>
<dt> ö </dt><dd>C-x 8 "o
</dd>
<dt> ü </dt><dd>C-x 8 "u
</dd>
<dt> ß </dt><dd>C-x 8 "s
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> French：</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> à </dt><dd>C-x 8 `a
</dd>
<dt> â </dt><dd>C-x 8 ^a
</dd>
<dt> ä </dt><dd>C-x 8 "a
</dd>
<dt> æ </dt><dd>C-x 8 RET LATIN SMALL LETTER A E
</dd>
<dt> é </dt><dd>C-x 8 'e
</dd>
<dt> è </dt><dd>C-x 8 `e
</dd>
<dt> ê </dt><dd>C-x 8 ^e
</dd>
<dt> ë </dt><dd>C-x 8 "e
</dd>
<dt> î </dt><dd>C-x 8 ^i
</dd>
<dt> ï </dt><dd>C-x 8 "i
</dd>
<dt> ô </dt><dd>C-x 8 ^o
</dd>
<dt> œ </dt><dd>C-x 8 RET 153 RET
</dd>
<dt> ù </dt><dd>C-x 8 `u
</dd>
<dt> û </dt><dd>C-x 8 ^u
</dd>
<dt> ü </dt><dd>C-x 8 "u
</dd>
<dt> ç </dt><dd>C-x 8 ,c
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Others</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> € </dt><dd>C-x 8 RET EURO SIGH
</dd>
</dl>
</div>
</div>
